#Домашнее задание
#Homework1.py
#Создать 5 переменных разных типов и сделать из них небольшой текст.
#*SoloLearn Python
#*https://pythontutor.ru/

name = 'Eugene'
age = 30
position = 'QA Tester'
company = 'DataArt'
hometown = 'Novogorod-Seversky'
town = 'Kharkiv'

print(f"My name is {name}, I'm {age}, I have been working in a {position} position for over 4 years. I'm from {hometown} but right now I'm located in {town}. Thanks")